status/2021/27aug21.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>21 August 2021 - 27 August 2021</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">21 August 2021 - 27 August 2021</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orga4300c9">1. MIT OCW</a>
<ul>
<li><a href="#org6bd43b5">1.1. 18.01 - Single Variable Calculus</a>
<ul>
<li><a href="#org84bcda3">1.1.1. Completed sessions 10-12</a></li>
<li><a href="#orgf7862af">1.1.2. Completed PS1 1A and 1B</a></li>
<li><a href="#org275116e">1.1.3. CRC problems</a></li>
</ul>
</li>
<li><a href="#orgad66f5f">1.2. 8.01 - Physics I - Classical Mechanics</a></li>
</ul>
</li>
<li><a href="#org95d1685">2. US index Map</a></li>
<li><a href="#orge44a996">3. Marble Computation</a>
<ul>
<li><a href="#orgfd6e4b5">3.1. Next Steps</a>
<ul>
<li><a href="#org4a6d0f6">3.1.1. Continue Reversible Computation Study</a></li>
<li><a href="#org2ae3772">3.1.2. Prototype Marble inverter</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org87ffc36">4. Sun Ultra 10</a>
<ul>
<li><a href="#org29bf22d">4.1. Next steps</a>
<ul>
<li><a href="#orgc82fc82">4.1.1. Serial debug</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb867afc">5. Apple iMac G4</a>
<ul>
<li><a href="#org43c37bf">5.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org81de797">6. Davies Brothel</a></li>
<li><a href="#org12bbac3">7. Linux Audio</a>
<ul>
<li><a href="#orgd527c57">7.1. pvanal to spectrogram</a>
<ul>
<li><a href="#orgbd70db8">7.1.1. Next steps</a></li>
</ul>
</li>
<li><a href="#orgdf4a9ae">7.2. CSound programming.</a>
<ul>
<li><a href="#org97804c2">7.2.1. Next Steps</a></li>
</ul>
</li>
<li><a href="#org83db496">7.3. Faust programming</a>
<ul>
<li><a href="#orgfcfd9df">7.3.1. Next Steps</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgeb0c722">8. EPICS</a>
<ul>
<li><a href="#org4ce6b23">8.1. Next steps</a>
<ul>
<li><a href="#orgb012d6c">8.1.1. u3scpi network port testing</a></li>
<li><a href="#org83216e4">8.1.2. initial EPICS interface</a></li>
<li><a href="#orgdf26b9d">8.1.3. u3scpi analog/digital port reconfiguration.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb89e374">9. Brini Tracker II</a>
<ul>
<li><a href="#org7913262">9.1. Next steps</a>
<ul>
<li><a href="#org98f2b11">9.1.1. Validate remaining standard GPS messages</a></li>
<li><a href="#org4d58062">9.1.2. Investigate GPS chipset data logging</a></li>
<li><a href="#org2030aba">9.1.3. Investigate LoRA radio interface</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org0ece2c3">10. wktcolor</a>
<ul>
<li><a href="#org8d4c027">10.1. Next steps</a>
<ul>
<li><a href="#org6fe15d9">10.1.1. Explore how to get a minimal coloring</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5b6dfaf">11. wktplot</a>
<ul>
<li><a href="#orgb3e7616">11.1. Next steps</a></li>
</ul>
</li>
<li><a href="#org290cc40">12. AMDGPU</a>
<ul>
<li><a href="#org0416839">12.1. Next step</a>
<ul>
<li><a href="#orgc30bed0">12.1.1. Reverse engineer HSAKMT programming.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga1c7401">13. Ninja v Make</a>
<ul>
<li><a href="#org391eb2c">13.1. Next Step</a>
<ul>
<li><a href="#orgf9ddac1">13.1.1. clean simple measurements</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb0d34ec">14. GMP Forth</a>
<ul>
<li><a href="#org5655426">14.1. Need to think about adding floating point support</a></li>
<li><a href="#org9c192c0">14.2. Port to non-Linux OS</a></li>
</ul>
</li>
<li><a href="#org264206c">15. ca-r</a>
<ul>
<li><a href="#org6fc3205">15.1. Next Step</a></li>
</ul>
</li>
<li><a href="#org2fb22f0">16. Swocer</a>
<ul>
<li><a href="#orgf809081">16.1. Most crashing addressed</a></li>
<li><a href="#org6ea922b">16.2. Added outline for 'bottle' test</a></li>
<li><a href="#org7430e53">16.3. Next steps</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
Studies moving forward - slowly
</p>

<div id="outline-container-orga4300c9" class="outline-2">
<h2 id="orga4300c9"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6bd43b5" class="outline-3">
<h3 id="org6bd43b5"><span class="section-number-3">1.1.</span> 18.01 - Single Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org84bcda3" class="outline-4">
<h4 id="org84bcda3"><span class="section-number-4">1.1.1.</span> Completed sessions 10-12</h4>
</div>
<div id="outline-container-orgf7862af" class="outline-4">
<h4 id="orgf7862af"><span class="section-number-4">1.1.2.</span> Completed PS1 1A and 1B</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Need to finish 1C-1G
</p>
</div>
</div>
<div id="outline-container-org275116e" class="outline-4">
<h4 id="org275116e"><span class="section-number-4">1.1.3.</span> CRC problems</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
Fixed 2 errors in"Circular Functions of Some Special Angles".
</p>
</div>
</div>
</div>
<div id="outline-container-orgad66f5f" class="outline-3">
<h3 id="orgad66f5f"><span class="section-number-3">1.2.</span> 8.01 - Physics I - Classical Mechanics</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Completed Week 1; still need to finish problem set 1. Overlooked
"worked examples", so that's complete (through Wex 1.7). PS1 has
no obvious answer key, so am working out additional problems with
answers to solidify foundation - which really needs it.
</p>
</div>
</div>
</div>
<div id="outline-container-org95d1685" class="outline-2">
<h2 id="org95d1685"><span class="section-number-2">2.</span> US index Map</h2>
<div class="outline-text-2" id="text-2">
<p>
Sister Maureen needs some help with a US index map for geography
dept.  map collection. Done: <a href="https://github.com/daniel-kelley/us-1-2-index-map">https://github.com/daniel-kelley/us-1-2-index-map</a>
</p>
</div>
</div>
<div id="outline-container-orge44a996" class="outline-2">
<h2 id="orge44a996"><span class="section-number-2">3.</span> Marble Computation</h2>
<div class="outline-text-2" id="text-3">
<p>
Collected materials (thin copper plate, copper PCB blanks) for prototyping.
</p>
</div>
<div id="outline-container-orgfd6e4b5" class="outline-3">
<h3 id="orgfd6e4b5"><span class="section-number-3">3.1.</span> Next Steps</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org4a6d0f6" class="outline-4">
<h4 id="org4a6d0f6"><span class="section-number-4">3.1.1.</span> Continue Reversible Computation Study</h4>
</div>
<div id="outline-container-org2ae3772" class="outline-4">
<h4 id="org2ae3772"><span class="section-number-4">3.1.2.</span> Prototype Marble inverter</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
Using dual rail differential logic (left/,right/1), an inverter
merely switches sides. I think little "kickers" on the side should
be sufficient for a purely mechanical approach.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org87ffc36" class="outline-2">
<h2 id="org87ffc36"><span class="section-number-2">4.</span> Sun Ultra 10</h2>
<div class="outline-text-2" id="text-4">
<p>
Trying to see what state it is in. Fires up but no video. Need DB25M to
debug over serial port.
</p>
</div>
<div id="outline-container-org29bf22d" class="outline-3">
<h3 id="org29bf22d"><span class="section-number-3">4.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-orgc82fc82" class="outline-4">
<h4 id="orgc82fc82"><span class="section-number-4">4.1.1.</span> Serial debug</h4>
</div>
</div>
</div>
<div id="outline-container-orgb867afc" class="outline-2">
<h2 id="orgb867afc"><span class="section-number-2">5.</span> Apple iMac G4</h2>
<div class="outline-text-2" id="text-5">
<p>
Building userland may be a PITA due to lack of RAM. Build would often
segfault.
</p>
</div>
<div id="outline-container-org43c37bf" class="outline-3">
<h3 id="org43c37bf"><span class="section-number-3">5.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Not sure.
</p>
</div>
</div>
</div>

<div id="outline-container-org81de797" class="outline-2">
<h2 id="org81de797"><span class="section-number-2">6.</span> Davies Brothel</h2>
<div class="outline-text-2" id="text-6">
<p>
Next hearing: 02 September; Department 37
</p>
</div>
</div>
<div id="outline-container-org12bbac3" class="outline-2">
<h2 id="org12bbac3"><span class="section-number-2">7.</span> Linux Audio</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-orgd527c57" class="outline-3">
<h3 id="orgd527c57"><span class="section-number-3">7.1.</span> pvanal to spectrogram</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Enough of libriffr and libpvocf work to start pvoctool
<a href="https://github.com/daniel-kelley/pvoctool">https://github.com/daniel-kelley/pvoctool</a>. Have HDF5 output and
text delimited output for octave. Can import PVOC data to octave
spectrogram for display.
</p>
</div>
<div id="outline-container-orgbd70db8" class="outline-4">
<h4 id="orgbd70db8"><span class="section-number-4">7.1.1.</span> Next steps</h4>
<div class="outline-text-4" id="text-7-1-1">
<p>
Loop analysis
</p>
</div>
</div>
</div>
<div id="outline-container-orgdf4a9ae" class="outline-3">
<h3 id="orgdf4a9ae"><span class="section-number-3">7.2.</span> CSound programming.</h3>
<div class="outline-text-3" id="text-7-2">
<p>
The FORTRAN of computer music. Getting up to speed.
</p>
</div>
<div id="outline-container-org97804c2" class="outline-4">
<h4 id="org97804c2"><span class="section-number-4">7.2.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-2-1">
</div>
<ol class="org-ol">
<li><a id="orgd22de8f"></a>loscil demo<br /></li>
<li><a id="org8c1a12e"></a>spectrogram loop point analysis<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org83db496" class="outline-3">
<h3 id="org83db496"><span class="section-number-3">7.3.</span> Faust programming</h3>
<div class="outline-text-3" id="text-7-3">
</div>
<div id="outline-container-orgfcfd9df" class="outline-4">
<h4 id="orgfcfd9df"><span class="section-number-4">7.3.1.</span> Next Steps</h4>
<div class="outline-text-4" id="text-7-3-1">
</div>
<ol class="org-ol">
<li><a id="orga8dfb53"></a>GAC Patch save/restore<br /></li>
<li><a id="org5041a58"></a>LV2 autopatcher<br />
<div class="outline-text-5" id="text-7-3-1-2">
<p>
Exploratory tool to generate (was pd, ecasound, now carla) patch for arbitrary LV2 plugin:
hook up audio inputs to signal source, audio outputs to speakers, control inputs to
control surface, etc.
</p>
</div>
</li>
<li><a id="org4a8f85a"></a>OSC control surface<br />
<div class="outline-text-5" id="text-7-3-1-3">
<p>
Some sort of GUI tool (knob/slider) to OSC messages. This may be
as simple as a Faust UI program.
</p>
</div>
</li>
<li><a id="orgfefaf6c"></a>Faust/csound<br />
<div class="outline-text-5" id="text-7-3-1-4">
<p>
See if a faust generated unit works.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgeb0c722" class="outline-2">
<h2 id="orgeb0c722"><span class="section-number-2">8.</span> EPICS</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org4ce6b23" class="outline-3">
<h3 id="org4ce6b23"><span class="section-number-3">8.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-orgb012d6c" class="outline-4">
<h4 id="orgb012d6c"><span class="section-number-4">8.1.1.</span> u3scpi network port testing</h4>
</div>
<div id="outline-container-org83216e4" class="outline-4">
<h4 id="org83216e4"><span class="section-number-4">8.1.2.</span> initial EPICS interface</h4>
</div>
<div id="outline-container-orgdf26b9d" class="outline-4">
<h4 id="orgdf26b9d"><span class="section-number-4">8.1.3.</span> u3scpi analog/digital port reconfiguration.</h4>
</div>
</div>
</div>

<div id="outline-container-orgb89e374" class="outline-2">
<h2 id="orgb89e374"><span class="section-number-2">9.</span> Brini Tracker II</h2>
<div class="outline-text-2" id="text-9">
<p>
Suspended for now.
</p>
</div>
<div id="outline-container-org7913262" class="outline-3">
<h3 id="org7913262"><span class="section-number-3">9.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-org98f2b11" class="outline-4">
<h4 id="org98f2b11"><span class="section-number-4">9.1.1.</span> Validate remaining standard GPS messages</h4>
</div>
<div id="outline-container-org4d58062" class="outline-4">
<h4 id="org4d58062"><span class="section-number-4">9.1.2.</span> Investigate GPS chipset data logging</h4>
</div>
<div id="outline-container-org2030aba" class="outline-4">
<h4 id="org2030aba"><span class="section-number-4">9.1.3.</span> Investigate LoRA radio interface</h4>
</div>
</div>
</div>

<div id="outline-container-org0ece2c3" class="outline-2">
<h2 id="org0ece2c3"><span class="section-number-2">10.</span> wktcolor</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org8d4c027" class="outline-3">
<h3 id="org8d4c027"><span class="section-number-3">10.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-10-1">
</div>
<div id="outline-container-org6fe15d9" class="outline-4">
<h4 id="org6fe15d9"><span class="section-number-4">10.1.1.</span> Explore how to get a minimal coloring</h4>
<div class="outline-text-4" id="text-10-1-1">
<p>
Need a specific planar graph four coloring.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org5b6dfaf" class="outline-2">
<h2 id="org5b6dfaf"><span class="section-number-2">11.</span> wktplot</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgb3e7616" class="outline-3">
<h3 id="orgb3e7616"><span class="section-number-3">11.1.</span> Next steps</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Understand why -r doesn't solve the wktvor/wktdel "sliver at edge" problem.
Explore biological cell Voronoi organization
</p>
</div>
</div>
</div>

<div id="outline-container-org290cc40" class="outline-2">
<h2 id="org290cc40"><span class="section-number-2">12.</span> AMDGPU</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org0416839" class="outline-3">
<h3 id="org0416839"><span class="section-number-3">12.1.</span> Next step</h3>
<div class="outline-text-3" id="text-12-1">
</div>
<div id="outline-container-orgc30bed0" class="outline-4">
<h4 id="orgc30bed0"><span class="section-number-4">12.1.1.</span> Reverse engineer HSAKMT programming.</h4>
</div>
</div>
</div>

<div id="outline-container-orga1c7401" class="outline-2">
<h2 id="orga1c7401"><span class="section-number-2">13.</span> Ninja v Make</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org391eb2c" class="outline-3">
<h3 id="org391eb2c"><span class="section-number-3">13.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgf9ddac1" class="outline-4">
<h4 id="orgf9ddac1"><span class="section-number-4">13.1.1.</span> clean simple measurements</h4>
</div>
</div>
</div>

<div id="outline-container-orgb0d34ec" class="outline-2">
<h2 id="orgb0d34ec"><span class="section-number-2">14.</span> GMP Forth</h2>
<div class="outline-text-2" id="text-14">
</div>
<div id="outline-container-org5655426" class="outline-3">
<h3 id="org5655426"><span class="section-number-3">14.1.</span> Need to think about adding floating point support</h3>
</div>
<div id="outline-container-org9c192c0" class="outline-3">
<h3 id="org9c192c0"><span class="section-number-3">14.2.</span> Port to non-Linux OS</h3>
</div>
</div>
<div id="outline-container-org264206c" class="outline-2">
<h2 id="org264206c"><span class="section-number-2">15.</span> ca-r</h2>
<div class="outline-text-2" id="text-15">
<p>
Tier data finally deprecated so processing is removed.
</p>
</div>
<div id="outline-container-org6fc3205" class="outline-3">
<h3 id="org6fc3205"><span class="section-number-3">15.1.</span> Next Step</h3>
<div class="outline-text-3" id="text-15-1">
<p>
None.
</p>
</div>
</div>
</div>
<div id="outline-container-org2fb22f0" class="outline-2">
<h2 id="org2fb22f0"><span class="section-number-2">16.</span> Swocer</h2>
<div class="outline-text-2" id="text-16">
</div>
<div id="outline-container-orgf809081" class="outline-3">
<h3 id="orgf809081"><span class="section-number-3">16.1.</span> Most crashing addressed</h3>
<div class="outline-text-3" id="text-16-1">
<p>
Nullified 'handle' API free functions helped a lot.
Still see some errors in operations.
</p>
</div>
</div>
<div id="outline-container-org6ea922b" class="outline-3">
<h3 id="org6ea922b"><span class="section-number-3">16.2.</span> Added outline for 'bottle' test</h3>
<div class="outline-text-3" id="text-16-2">
<p>
Added all functions believed to be needed for 'bottle' demo test.
Test doesn't pass so is disabled.
</p>
</div>
</div>
<div id="outline-container-org7430e53" class="outline-3">
<h3 id="org7430e53"><span class="section-number-3">16.3.</span> Next steps</h3>
<div class="outline-text-3" id="text-16-3">
<p>
Swocer future.
Check out what's needed for gears.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:39</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>